* Advent of Code 2020

My answers for [[https://adventofcode.com/2020][Advent of Code 2020]].

| Day         | [[https://racket-lang.org/][Racket]] |   C | [[https://www.dyalog.com/][APL]] |
|-------------+--------+-----+-----|
| Day 1       |      2 |   2 |   2 |
| Day 2       |      2 |   2 |   2 |
| Day 3       |      2 |   2 |   2 |
| Day 4       |      2 |     |     |
| Day 5       |      2 |   2 |   2 |
| Day 6       |      2 |   2 |   2 |
| Day 7       |      2 |     |   2 |
| Day 8       |      2 |   2 |     |
| Day 9       |      2 |   2 |   2 |
| Day 10      |      2 |   2 |   2 |
| Day 11      |      2 |     |   1 |
| Day 12      |      2 |   2 |     |
| Day 13      |      2 |   2 |   2 |
| Day 14      |      2 |   2 |     |
| Day 15      |      2 |   2 |     |
| Day 16      |      2 |     |     |
| Day 17      |      2 |   2 |     |
| Day 18      |      2 |     |   1 |
| Day 19      |      2 |     |     |
| Day 20      |      2 |     |     |
| Day 21      |      2 |     |     |
| Day 22      |      2 |     |     |
| Day 23      |      2 |   2 |     |
| Day 24      |      2 |     |     |
| Day 25      |      2 |   2 |     |
|-------------+--------+-----+-----|
| *Total (%)* |    100 | 60. | 40. |
#+TBLFM: @>$2..$4=50*vmean(@I..@II);ENn3
